AndEmi81/indesit_inertia_rx210/ProductModules/PM_EnergyMeter/EM_Cirrus5460_Mng.c
/*
Copyright (c) 2004-2005, Indesit Company, I.D.D..
Tutti i diritti sono riservati. All rights reserved.
*/
/**
\defgroup	EM Energy Meter
@{
\Par		Energy Meter
\n		This module implements the interface APIs to the Energy Meter.
\n    The Energy Meter is based on Cirrus5461 chip. The communication is made via \link SWSPI \endlink
\n    Available operations on this device are mainly Reset, Configure (default configuration not changeable), Start and Stop measure.
\n    Then you can read energy parameters like Power, V, I, Vrms, Irms, TotEnergy (Since start) both as raw data or in Watts, Volts, and Amperes.
\n    
\n    There are also APIs that allows to start and stop Energy consumption counters:
\n    With start you must provide also a time period and an energy thresholds.
\n    On these counters you can retrieve the value (energy in Wh consumed since start), the time elapsed (s since start) and the MAX energy consumed in a 10 seconds time slice.
\n    Moreover you have back some flags that tells if the energy counter reached the given threshold in the given time period.
\n    Other flags are the running state of the counter (started/stopped) and the running state of the timer (Time period elapsed or not).
@}
\ingroup PM
*/

/**
\n
\Par		Product Module Energy Meter
\n
\file		  ${EM_Cirrus5460_Mng.c}
\ingroup	EM
\date		  01.10.2009
\version	Platform2_00.00.12 (project baseline related to creation of this module)
\author		Andrea Mantovani
\n
\n
\Par\b	History:
\n 
\n 		00.00.12 
\n		01/10/2009 
\n		developer Andrea Mantovani
\n		changes First revision
\n 			
\n
\n
\n 		01.03.00 <baseline di progetto relativa alla versione precedente la corrente>
\n		gg/mm/aaaa <data in cui è stata realizzata >
\n		developer <progettista autore della modifica>
\n		changes <principali modifiche apportate>
\n 		- change 1
\n		- change 2
\n
\n
\n 
*/

/* ******** */
/* Includes */
/* ******** */


#include "StandardDefines.h"

#include "EM_Cirrus5460_Mng.h"
#include "Cirrus5460def.h"

#include "OCDIO_drv.h"
#include "SWSPI_drv.h"

/* ****************** */
/* Defines and Macros */
/* ****************** */


#define	CIRRUS_CS_CLEAR       OCDIO_SetPinValueSync((uint8_t)SPISW_CS_IO_PIN, (uint8_t)LOW)
#define	CIRRUS_CS_SET         OCDIO_SetPinValueSync((uint8_t)SPISW_CS_IO_PIN, (uint8_t)HI)
#define	CIRRUS_RESET_CLEAR    OCDIO_SetPinValueSync((uint8_t)EM_RESET_IO_PIN, (uint8_t)LOW)
#define	CIRRUS_RESET_SET      OCDIO_SetPinValueSync((uint8_t)EM_RESET_IO_PIN, (uint8_t)HI)


/* 
  this define should be more general
  to do...
 */
#define nop()  _NOP_()


/* *************************** */
/* Typedef, Structs and Unions */
/* *************************** */


/* ********* */
/* Variables */
/* ********* */

/* Exported */

/* Static */
static uint8_t CirrusTemp[4]; 

static uint32_t  aui32PavgSinceStart[2]={0,0}; /*64 bit accumulator: [0]=MSB [1]=LSB*/
static uint32_t  ui32TimeElapsedSinceStart=0; /*sec*/
static bool_t    bAccuEnabled=FALSE;
static uint16_t  ui16CirrusReadingCounter=0;

static stEnergyCounters_t astCounters[MAX_NUM_ENERGYCOUNTERS];

/* ******************* */
/* Functions Prototype */
/* ******************* */

/* local functions */
/* change to static?
  to do...
*/
void SwInit_SPIsw_CS5460(void);
void PowerMeter_HWRecover(void); 
void WriteReg_SPIsw_CS5460(uint8_t CirrusReg, const uint8_t *PValue);  
void ReadReg_SPIsw_CS5460(uint8_t CirrusReg, uint8_t *DataBuf); 
void SerialInit_SPIsw_CS5460(void);
void SwReset_SPIsw_CS5460(void); 
uint32_t Raw2WattHour(uint32_t ui32Input);

/* *************** */
/* Function Bodies */
/* *************** */

/* Exported functions */

/*---------------------------------------------------

Cirrus Initialization Functions:

According to CIRRUS data sheet the serial port reset can be performed by any of the following actions.

1-  drive CS pin low (if it's already low perform low->high an then high->low transitions)
2-  Hw reset: drive reset low for at least 10 us.
3-  Issue serial port initialization sequence that is clocking 3 (or more) SYNCH1 command bytes followed by one SYNCH0 byte

if CS is driven low and high at each SPI access we can avoid implementing procedure 1-
---------------------------------------------------*/ 

/*----------------------
   HW reset function
----------------------*/ 
void PowerMeter_HWReset(void) 
{
  uint8_t ui8Count;   

  CIRRUS_RESET_CLEAR;
  
  /* how to perform 10us delay ?*/
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  }
     
  CIRRUS_RESET_SET; 
  
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  }
  
}

/*----------------------
   HW recover function
----------------------*/ 
void PowerMeter_HWRecover(void) 
{ 

  uint8_t ui8Count;

  CIRRUS_CS_CLEAR;
  
  
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  }
  
  CIRRUS_RESET_CLEAR;
  
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  }   
  
  CIRRUS_RESET_SET; 
  
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  }
  
  /*SerialInit_SPIsw_CS5460();*/   /*	 Init CS5460 serial port */
  
  /*SwReset_SPIsw_CS5460();*/
  
  SwInit_SPIsw_CS5460();
  
  SerialInit_SPIsw_CS5460();   	/* Init CS5460 serial port */
  
  CIRRUS_CS_SET;
  
}



/*-------------------------------- 
 Reset and config Cirrus registers
 with default values
 ---------------------------------*/
 
void PowerMeter_InitConfig(void)
{
  uint8_t ui8Count;
       
  CIRRUS_RESET_CLEAR;
  
  /* how to implement 10us delay?*/
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  } 
  
  CIRRUS_RESET_SET;
  
  /* guard time */
  for(ui8Count=0;ui8Count<8;ui8Count++) 
  {
    nop();
  }
  
  /* SerialInit_SPIsw_CS5460();*/
  
  SwInit_SPIsw_CS5460();
  
  SerialInit_SPIsw_CS5460();   
  
  CIRRUS_CS_SET;  
 }  
 
 
 /*------------------------------ 
 Sends Start calibration  command
 --------------------------------*/  
 void PowerMeter_StartCal(void) 
 {
    /* which sequence to implement? */
 }


 /*------------------------------ 
 Sends Start measure command according
 to parameter passed.
 --------------------------------*/
 void PowerMeter_StartMeasure(eConvertion_t C_Conv,bool_t bResetCounters)
 {
   /*
     Reset energy accumulator
     Activate flag to enable accumulation
   */
   
   if(bResetCounters==TRUE) 
   {
     aui32PavgSinceStart[0]=0;
     aui32PavgSinceStart[1]=0;
     ui32TimeElapsedSinceStart=0;
   }
   
   bAccuEnabled=TRUE;
    
 
   if(C_Conv==SINGLE_CONV) 
   {
     CirrusTemp[0]= STARTSINGLECONV;
   }
   else 
   {
     CirrusTemp[0]= STARTCONTCONV; 
   }
    
