AndEmi81/indesit_inertia_rx210/ProductModules/PM_EnergyMeter/EM_Cirrus5460_Mng.c
   CIRRUS_CS_CLEAR;
     
   SWSPI_WriteDataSync((uint8_t)1, CirrusTemp);  

   CIRRUS_CS_SET;
  
 }

/*--------------------------------- 
 Reset flag to disable accumulation
 ----------------------------------*/  
void PowerMeter_StopMeasure(void) 
{
  bAccuEnabled=FALSE;
}

/*----------------------------------------------- 
 Returns the value of the instant I reg of Cirrus
 the value is in range -1 +1 with 2^(-23) resolution
 ------------------------------------------------*/ 
void PowerMeter_GetInstant_I(uint8_t *Ibin) 
{ 
  ReadReg_SPIsw_CS5460 ((uint8_t)I_Register, CirrusTemp );
  
  *(Ibin)=CirrusTemp[0];
  *(Ibin+1)=CirrusTemp[1];
  *(Ibin+2)=CirrusTemp[2];
}

/*----------------------------------------------- 
 Returns the value of the instant V reg of Cirrus
 the value is in range -1 +1 with 2^(-23) resolution
 ------------------------------------------------*/ 
void PowerMeter_GetInstant_V(uint8_t *Vbin)
{ 
  ReadReg_SPIsw_CS5460 ((uint8_t)V_Register, CirrusTemp );
  
  * (Vbin)=CirrusTemp[0];
  * (Vbin+1)=CirrusTemp[1];
  * (Vbin+2)=CirrusTemp[2];
}   


/*----------------------------------------------- 
 Returns the value of the instant P reg of Cirrus
 the value is in range -1 +1 with 2^(-23) resolution
 ------------------------------------------------*/ 
void PowerMeter_GetInstant_P(uint8_t *Pbin) 
{
  ReadReg_SPIsw_CS5460 ((uint8_t)P_Register, CirrusTemp );
  
  * (Pbin)=CirrusTemp[0];
  * (Pbin+1)=CirrusTemp[1];
  * (Pbin+2)=CirrusTemp[2];
}

/*----------------------------------------------
  Return the value of Pavg reg that is 
  the average power calculated on last N samples.
  ----------------------------------------------*/
void PowerMeter_GetAvgLastCycle_P(uint8_t *Pavgbin) 
{
  ReadReg_SPIsw_CS5460 ((uint8_t)E_Register, CirrusTemp );
  
  * (Pavgbin)=CirrusTemp[0];
  * (Pavgbin+1)=CirrusTemp[1];
  * (Pavgbin+2)=CirrusTemp[2];
  
}

/*------------------------------------------------------
  Return the value of Pavg reg converted in 100mW units.
  Pavg is the average power calculated on last N samples.   
  -----------------------------------------------------*/
void PowerMeter_GetAvgLastCycle_P_100mW(uint32_t *ui32Pavgbin) 
{
  uint32_t ui32Result=0;
  int16_t  i16Exp=0;

  /* read Pavg from Cirrus*/
  ReadReg_SPIsw_CS5460 ((uint8_t)E_Register, CirrusTemp );
  
  ui32Result  =	(uint32_t)CirrusTemp[2];
  ui32Result |=	(uint32_t)CirrusTemp[1] <<8;
  ui32Result |=	(uint32_t)CirrusTemp[0] <<16;
  
  /*
    must get absolute value in case of negative ?
    to be verified...
  */
  if((ui32Result & 0x00800000UL)!=0UL) 
  {
    ui32Result = ~ui32Result;
    /* the previous operation inverted also MSByte that must be 0 instead */
    ui32Result &= 0x00FFFFFFUL;    
    ui32Result +=1UL;    
  }
  
  /*
    Pavg in in range -1 +1
    to keep 16Msb you have to divide by 2^7
  */
  ui32Result >>= 7;
  
  /* ( 16 bit X 16 bit resolution -> result fits in 32 bits) */
  ui32Result *= (uint32_t)DefaultKPP_ma; 
  
  /* apply exponent */  
  /*
    to avoid overflow in shift left calculate net shift that is:
    DefaultKPP_exp + 16
    note: 16 because 2^(-16) is the value of LSB 
  */
  i16Exp=DefaultKPP_exp + 16;
  
  if(i16Exp & 0x80)
	{
	  ui32Result <<= (-i16Exp);
	} else 
	{
	  ui32Result >>= i16Exp;
	}
	
	*ui32Pavgbin= ui32Result;
}


/*----------------------------------------------- 
 Returns the value of the I rms reg of Cirrus
 the value is in range 0 +1 with 2^(-24) resolution and is 
 calculated on last N samples
 ------------------------------------------------*/ 
void PowerMeter_Get_I_RMS(uint8_t *IrmsBin) 
{
  ReadReg_SPIsw_CS5460 ((uint8_t)IRMS_Register, CirrusTemp);  
  
  /*
    Portable but not optimized version  
    *Irms= CirrusTemp[2]| (CirrusTemp[1]<<8) | (CirrusTemp[0]<<16);       
  */

  * (IrmsBin)=CirrusTemp[0];
  * (IrmsBin+1)=CirrusTemp[1];
  * (IrmsBin+2)=CirrusTemp[2]; 
}

/*----------------------------------------------- 
 Returns the value of the I rms reg of Cirrus converted in 100mA units.
 The value is in range 0 +1 with 2^(-24) resolution and is 
 calculated on last N samples
 ------------------------------------------------*/ 
void PowerMeter_Get_I_RMS_100mA(uint32_t *ui32Irms) 
{
  uint32_t ui32Result=0;
  ReadReg_SPIsw_CS5460 ((uint8_t)IRMS_Register, CirrusTemp);  
  
  /*
    Portable but not optimized version  
 	  *Vrms= CirrusTemp[2]| (CirrusTemp[1]<<8) | (CirrusTemp[0]<<16);
  */
  
  ui32Result  =	(uint32_t)CirrusTemp[2];
  ui32Result |=	(uint32_t)CirrusTemp[1] <<8;
  ui32Result |=	(uint32_t)CirrusTemp[0] <<16;  

  /* 
     Irms is in range 0.0--1.0
     to keep 16Msb you have to divide by 2^8
  */  
  ui32Result >>= 8;
  
  /* ( 16 bit X 16 bit resolution -> result fits in 32 bits) */
  ui32Result *= (uint32_t)DefaultKII_ma; 
  
  /* apply exponent */  
  if(DefaultKII_exp <0)
	{
	  ui32Result <<= (-DefaultKII_exp);
	} else 
	{
	  ui32Result >>= DefaultKII_exp;
	}
	
	/* 2^(-16) is the value of LSB */
	ui32Result >>= 16;
	
	*ui32Irms= ui32Result;

}


/*----------------------------------------------- 
 Returns the value of the V rms reg of Cirrus
 the value is in range 0 +1 with 2^(-24) resolution and is 
 calculated on last N samples
 ------------------------------------------------*/ 
void PowerMeter_Get_V_RMS(uint8_t *VrmsBin) 
{
   ReadReg_SPIsw_CS5460 ((uint8_t)VRMS_Register, CirrusTemp );
  
  /*
    Portable but not optimized version  
 	  *Vrms= CirrusTemp[2]| (CirrusTemp[1]<<8) | (CirrusTemp[0]<<16);
  */

   	* (VrmsBin)=CirrusTemp[0];
   	* (VrmsBin+1)=CirrusTemp[1];
  	* (VrmsBin+2)=CirrusTemp[2];

}

/*----------------------------------------------- 
 Returns the value of the I rms reg of Cirrus converted in 100mV units.
 The value is in range 0 +1 with 2^(-24) resolution and is 
 calculated on last N samples.
 ------------------------------------------------*/ 
void PowerMeter_Get_V_RMS_100mV(uint32_t *ui32Vrms) 
{
   uint32_t ui32Result=0;
   ReadReg_SPIsw_CS5460 ((uint8_t)VRMS_Register, CirrusTemp );
  
  /*
    Portable but not optimized version  
 	  *Vrms= CirrusTemp[2]| (CirrusTemp[1]<<8) | (CirrusTemp[0]<<16);
  */
  
