AndEmi81/indesit_inertia_rx210/ProductModules/PM_EnergyMeter/EM_Cirrus5460_Mng.c
  ui32Result  =	(uint32_t)CirrusTemp[2];
  ui32Result |=	(uint32_t)CirrusTemp[1] <<8;
  ui32Result |=	(uint32_t)CirrusTemp[0] <<16;  

  /* 
     Vrms is in range 0.0--1.0
     to keep 16Msb you have to divide by 2^8
  */  
  ui32Result >>= 8;
  
  /* ( 16 bit X 16 bit resolution) */
  ui32Result *= (uint32_t)DefaultKVV_ma; 
  
  /* apply exponent */  
  if(DefaultKVV_exp <0)
	{
	  ui32Result <<= (-DefaultKVV_exp);
	} else 
	{
	  ui32Result >>= DefaultKVV_exp;
	}
	
	/* 2^(-16) is the value of LSB */
	ui32Result >>= 16;
	
	*ui32Vrms= ui32Result;

}

/*--------------------------------------------------------------------------
Returns the value of energy in Wh since the last start measure.
----------------------------------------------------------------------------*/
void PowerMeter_GetAvgSinceStart_E_Wh(uint8_t *EWh,uint32_t *pui32TimeElapsed)
{
  uint32_t ui32PavgAccLo;
  uint32_t ui32PavgAccHi;
  uint32_t aui32PavgAcc[2]={0,0};
  int16_t  i16Exp=0;
  
  *pui32TimeElapsed= ui32TimeElapsedSinceStart;
  
  /* 
     bits [0-15] discarded
     Multiply bits [16-31] by KEE 
  */
  ui32PavgAccLo = Raw2WattHour(aui32PavgSinceStart[1]);  
  /*
  ui32PavgAccLo  =((aui32PavgSinceStart[1]>>16)&0x0000FFFFUL);

  ui32PavgAccLo *= (uint32_t)DefaultKEE_ma; 
  
  // apply exponent 
  if(DefaultKEE_exp <0)
	{
	  ui32PavgAccLo <<= (-DefaultKEE_exp);
	} else 
	{
	  ui32PavgAccLo >>= DefaultKEE_exp;
	} 
	
  // 2^(-7) is the value of LSB 
	ui32PavgAccLo >>= 7;
	*/
	
 /*
  You could also keep bits [32-47]
 */	
 // ui32PavgAccHi = Raw2WattHour(aui32PavgSinceStart[0]);
 
   
  ui32PavgAccHi  =(aui32PavgSinceStart[0]&0x0000FFFFUL);
  
  ui32PavgAccHi *= (uint32_t)DefaultKEE_ma; 
  
  // apply exponent
  /*
    to avoid overflow in shift left calculate net shift that is:
    DefaultKPP_exp + 1
    note: +1 because 2^(+1) is the value of LSB 
  */
  i16Exp=DefaultKEE_exp - 1;
  
  if(i16Exp & 0x80)
	{
	  ui32PavgAccHi <<= (-i16Exp);
	} else 
	{
	  ui32PavgAccHi >>= i16Exp;
	}
   
  
  /*
    Sum 32+32 to get 64bits
  */
  aui32PavgAcc[1]= ui32PavgAccHi<<16;
  if((0xFFFFFFFFUL-aui32PavgAcc[1])<ui32PavgAccLo)
  {
    /* overflow condition add carry */
    aui32PavgAcc[0]++;
  }
  aui32PavgAcc[1] += ui32PavgAccLo;
      
  
  *(EWh)  =(uint8_t) (aui32PavgAcc[0]&0x000000FFUL);       /*MSB*/  
	*(EWh+1)=(uint8_t)((aui32PavgAcc[1]&0xFF000000UL)>>24);
 	*(EWh+2)=(uint8_t)((aui32PavgAcc[1]&0x00FF0000UL)>>16);
	*(EWh+3)=(uint8_t)((aui32PavgAcc[1]&0x0000FF00UL)>>8);
	*(EWh+4)=(uint8_t) (aui32PavgAcc[1]&0x000000FFUL);       /*LSB*/
}


/*----------------------------------------------------------------------
  If the accumulation flag is enabled poll if a new Pavg is available.
  In that case accumulate the new val.
  If this function is called fast enough, a new value is read each second
  ---------------------------------------------------------------------*/                                                                   
void PowerMeter_Accum(void) 
{
  uint8_t  statusRegTmp[3];
  uint32_t ui32Result=0;
  uint8_t  ui8Index;
   
  if(TRUE==bAccuEnabled) 
  {
    /*  read Status_Register*/
    ReadReg_SPIsw_CS5460 ((uint8_t)Status_Register, statusRegTmp );
    if(   (statusRegTmp[0] & DRDY)!=0) 
    {
      ui16CirrusReadingCounter=0;
  
      
  #ifdef AIM_BOARD
  #ifdef AIM_debug
     /* Only for debug 
       led orange OFF
      */
      PTAD_PTAD1=0;
        
      /* Only for debug 
         led yellow ON
      */
      PTAD_PTAD2=1;
  #endif
  #endif
      
      
      ReadReg_SPIsw_CS5460 ((uint8_t)E_Register, CirrusTemp );

      /*one second has elapsed after last read*/
      ui32TimeElapsedSinceStart++;
            
      ui32Result  =	(uint32_t)CirrusTemp[2];
      ui32Result |=	(uint32_t)CirrusTemp[1] <<8;
      ui32Result |=	(uint32_t)CirrusTemp[0] <<16;
      
      /*
        must get absolute value in case of negative ?
        to be verified...
      */
      if((ui32Result & 0x00800000UL)!=0UL) 
      {
        ui32Result = ~ui32Result;
        /* the previous operation inverted also MSByte that must be 0 instead */
        ui32Result &= 0x00FFFFFFUL;    
        ui32Result +=1UL;    
      }  
      
      /*
       execute accumulation over 64 bit
      */
      if((0xFFFFFFFFUL-aui32PavgSinceStart[1])<ui32Result)
      {
        /* overflow condition add carry */
        aui32PavgSinceStart[0]++;
      }
      aui32PavgSinceStart[1] += ui32Result;
      
      
      /* Accumulate partial energy counters 
         Energy Monitor
      */
      
      for(ui8Index=0;ui8Index<MAX_NUM_ENERGYCOUNTERS;ui8Index++) 
      {
        /* if counter enabled*/
        if((astCounters[ui8Index].ui8Flags & EM_COUNT_STAT_MASK) !=0) 
        {
          /* accumulate energy and time */
          astCounters[ui8Index].ui32RawAccum += ui32Result;
          astCounters[ui8Index].ui32Raw10secAcc += ui32Result;
          astCounters[ui8Index].ui16TimeElapsed++;
          
          if(((astCounters[ui8Index].ui16TimeElapsed) % 10)==0) 
          {
             /*
               save the max in 10 secs as raw
             */
             if(astCounters[ui8Index].ui32Raw10secAcc > astCounters[ui8Index].ui32RawMaxEnergy10sec)
             {
               astCounters[ui8Index].ui32RawMaxEnergy10sec=astCounters[ui8Index].ui32Raw10secAcc;
             }
             astCounters[ui8Index].ui32Raw10secAcc=0;
          }
          
          /* if time period not yet elapsed but current time > time period ... */
          if ( (astCounters[ui8Index].ui16TimeElapsed>=astCounters[ui8Index].ui16TimePeriod) &&
                ((astCounters[ui8Index].ui8Flags & EM_T_ELAPSED_MASK) ==0) )
          {
            /* detect transition */ 
            astCounters[ui8Index].ui8Flags |= EM_T_ELAPSED_MASK;
            
            /* calculate energy consumed so far in Wh...*/
            astCounters[ui8Index].ui16EnergyCons =(uint16_t) Raw2WattHour(astCounters[ui8Index].ui32RawAccum);
            /*... if it is grater then energy threshold */
            if(astCounters[ui8Index].ui16EnergyCons > astCounters[ui8Index].ui16EnergyTreshold) 
            {
              /* set the overrun flag*/
              astCounters[ui8Index].ui8Flags |= EM_E_OVERRUN_MASK;
            }
          }
        }
      }
      
