AndEmi81/indesit_inertia_rx210/ProductModules/PM_EnergyMeter/EM_Cirrus5460_Mng.c
      /*
       Clear DRDY bit
       Writing 1 it clears that bit!
      */
      statusRegTmp[0]=0;
      statusRegTmp[1]=0;
      statusRegTmp[2]=0;
      statusRegTmp[0] |= DRDY;
      WriteReg_SPIsw_CS5460((uint8_t)Status_Register, statusRegTmp);
      
      #ifdef AIM_BOARD
      #ifdef AIM_debug
      
      /* Only for debug 
         led yellow OFF
      */
      PTAD_PTAD2=0;
      
      #endif
      #endif
    }
    else 
    {
      ReadReg_SPIsw_CS5460 ((uint8_t)Cycle_Count_Register, statusRegTmp );
      if (
           (statusRegTmp[0] != (uint8_t)((DefaultCirrusCycle&0x00FF0000UL)>>16UL))  ||        
           (statusRegTmp[1] != (uint8_t)((DefaultCirrusCycle&0x0000FF00UL)>>8UL))  ||
           (statusRegTmp[2] != (uint8_t)((DefaultCirrusCycle&0x000000FFUL)))
      ) 
      {
            
        /* check if Cirrus is stucked */
  #ifdef AIM_BOARD     
  #ifdef AIM_debug
       
        /* Only for debug 
         led orange ON
        */
        PTAD_PTAD1=1;
        
  #endif
  #endif
        
        PowerMeter_HWRecover();
        PowerMeter_StartMeasure(CONTINUOUS_CONV,FALSE);
   
      } else 
      {
        /* update counter for timeout*/
        ui16CirrusReadingCounter++;
        if(ui16CirrusReadingCounter>1500) 
        {
                  /* check if Cirrus is stucked */
  #ifdef AIM_BOARD     
  #ifdef AIM_debug
       
        /* Only for debug 
         led orange ON
        */
        PTAD_PTAD1=1;
        
  #endif
  #endif
        
        PowerMeter_HWRecover();
        PowerMeter_StartMeasure(CONTINUOUS_CONV,FALSE);
        ui16CirrusReadingCounter=0;
        }
      }
    }
  }
}
    

/*--------------------------------
  Starts the given Energy counter
  --------------------------------*/                                                                   

uint8_t PowerMeter_StartEnergyCount(uint8_t ui8CounterId,stEnergyCounters_t* pstCounterData) 
{
  if((ui8CounterId<MAX_NUM_ENERGYCOUNTERS)&& (pstCounterData != NULL))
  {
    astCounters[ui8CounterId]=(*pstCounterData);
    astCounters[ui8CounterId].ui8Flags=0;
    astCounters[ui8CounterId].ui8Flags |= EM_COUNT_STAT_MASK;
    astCounters[ui8CounterId].ui16EnergyCons=0;
    astCounters[ui8CounterId].ui16TimeElapsed=0;
    astCounters[ui8CounterId].ui16MaxEnergy10sec=0;
    astCounters[ui8CounterId].ui32RawAccum=0;
    astCounters[ui8CounterId].ui32Raw10secAcc=0;
    astCounters[ui8CounterId].ui32RawMaxEnergy10sec=0;
    
    return 0;
  } 
  else
  {
    return 1;
  }
}


/*-----------------------------------------------------------------
  Returns energy consumption data about the given Energy counter id
  -----------------------------------------------------------------*/
uint8_t PowerMeter_GetEnergyCount(uint8_t ui8CounterId,stEnergyCounters_t* pstCounterData) 
{
  uint32_t ui32Tmp;
  
  if((ui8CounterId<MAX_NUM_ENERGYCOUNTERS)&& (pstCounterData != NULL))
  {
    /* calculate Energy in Wh */
    
    ui32Tmp = Raw2WattHour(astCounters[ui8CounterId].ui32RawAccum);     
    astCounters[ui8CounterId].ui16EnergyCons=ui32Tmp & 0x0000FFFF;
    
    ui32Tmp = Raw2WattHour(astCounters[ui8CounterId].ui32RawMaxEnergy10sec);
    astCounters[ui8CounterId].ui16MaxEnergy10sec=ui32Tmp & 0x0000FFFF;;    
    
    pstCounterData->ui8Flags=astCounters[ui8CounterId].ui8Flags;
    pstCounterData->ui16EnergyCons=astCounters[ui8CounterId].ui16EnergyCons;
    pstCounterData->ui16TimeElapsed=astCounters[ui8CounterId].ui16TimeElapsed;
    pstCounterData->ui16MaxEnergy10sec=astCounters[ui8CounterId].ui16MaxEnergy10sec;
    return 0;
  }
  else
  {
    return 1;
  }
}


/*--------------------------------
  Stops the given Energy counter
  --------------------------------*/
uint8_t PowerMeter_StopEnergyCount(uint8_t ui8CounterId) 
{
  if(ui8CounterId<MAX_NUM_ENERGYCOUNTERS)
  {
    astCounters[ui8CounterId].ui8Flags &= ~EM_COUNT_STAT_MASK;
    return 0;
  }
  else 
  {
    return 1;
  }
  
}


/*----------------- Local Functions ----------------*/

uint32_t Raw2WattHour(uint32_t ui32Input)
{
  uint32_t ui32Tmp;
   /* 
       bits [0-15] discarded
       Multiply bits [16-31] by KEE 
    */  
    ui32Tmp  =((ui32Input>>16)&0x0000FFFFUL);

    ui32Tmp *= (uint32_t)DefaultKEE_ma; 
    
    /* apply exponent */  
    if(DefaultKEE_exp <0)
  	{
  	  ui32Tmp <<= (-DefaultKEE_exp);
  	} else 
  	{
  	  ui32Tmp >>= DefaultKEE_exp;
  	} 
  	
    /* 2^(-7) is the value of LSB */
  	ui32Tmp >>= 7;
  	
  	return ui32Tmp;
}

/*----------------------
   Serial init sequence
  -----------------------*/
void SerialInit_SPIsw_CS5460(void)
{     
        
  CirrusTemp[0]=SYNC1;
  CirrusTemp[1]=SYNC1;
  CirrusTemp[2]=SYNC1;
  CirrusTemp[3]=SYNC0;  
                           
  CIRRUS_CS_CLEAR;
           
  SWSPI_WriteDataSync((uint8_t)4, CirrusTemp); 
  
  CIRRUS_CS_SET;      
}                               


/*-------------------------- 
  SW reset 
  --------------------------*/
void SwReset_SPIsw_CS5460(void)
{		

  CirrusTemp[0] = SWRESET;
  
  CIRRUS_CS_CLEAR;
     
  SWSPI_WriteDataSync((uint8_t)1, CirrusTemp);
  
  CIRRUS_CS_SET;  
}
   
 

/*-------------------------- 
  Write to a Cirrus register 
  --------------------------*/    

/* PValue is a pointer to a 3 bytes char array */

void WriteReg_SPIsw_CS5460(uint8_t CirrusReg, const uint8_t *PValue)
{

	uint8_t PacketTemp[4]; 
                 		
  PacketTemp[0]= (uint8_t)((CirrusReg << 1) | WRITE_REGISTER);    
  PacketTemp[1]=  *PValue; 
	PacketTemp[2]=  *(PValue+1); 
	PacketTemp[3]=  *(PValue+2);
	 	
	 
  CIRRUS_CS_CLEAR;
            
  SWSPI_WriteDataSync((uint8_t)4, PacketTemp);      
  
  CIRRUS_CS_SET;
 }                 
 
 
/*-------------------------- 
  Read a Cirrus register 
  --------------------------*/
void ReadReg_SPIsw_CS5460(uint8_t CirrusReg, uint8_t *DataBuf)
{
  uint8_t DataOut[3]={SYNC0,SYNC0,SYNC0};
  
  CirrusTemp[0] = ((CirrusReg << 1) & READ_REGISTER);
  
  CIRRUS_CS_CLEAR;
     
  SWSPI_WriteDataSync((uint8_t)1, CirrusTemp);
  
  SWSPI_ReadDataSync((uint8_t)3, DataBuf,DataOut);
  
  CIRRUS_CS_SET;
   
