AndEmi81/indesit_inertia_rx210/ProductModules/PM_EnergyMeter/EM_Cirrus5460_Mng.c
 }
        
/*---------------------------------
  Cirrus Software reset 
  and write a constant configuration 
  ---------------------------------*/

void SwInit_SPIsw_CS5460(void)
{
   
  SwReset_SPIsw_CS5460();

  CirrusTemp[0]= (DefaultConfigRegister&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultConfigRegister&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultConfigRegister&0x0000FFUL);    
  
  WriteReg_SPIsw_CS5460((uint8_t)Config_Register, CirrusTemp);

  
  CirrusTemp[0]= (DefaultIoffset&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultIoffset&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultIoffset&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460(Offset_Register_I, CirrusTemp); 


  CirrusTemp[0]= (DefaultIgain&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultIgain&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultIgain&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460(Gain_Register_I, CirrusTemp);
  
 
  CirrusTemp[0]= (DefaultVoffset&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultVoffset&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultVoffset&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460(Offset_Register_V, CirrusTemp);

  
  CirrusTemp[0]= (DefaultVgain&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultVgain&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultVgain&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460(Gain_Register_V, CirrusTemp); 
  
 
  CirrusTemp[0]= (DefaultCirrusCycle&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultCirrusCycle&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultCirrusCycle&0x0000FFUL); 
  
  WriteReg_SPIsw_CS5460(Cycle_Count_Register, CirrusTemp);
    
  
  CirrusTemp[0]= (DefaultPrate&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultPrate&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultPrate&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460(Prate_Register, CirrusTemp);
  
  
  CirrusTemp[0]= (DefaultTBC&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (DefaultTBC&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (DefaultTBC&0x0000FFUL); 
  
  WriteReg_SPIsw_CS5460(TBC_Register, CirrusTemp);
  
  
  CirrusTemp[0]= (Cirrus_Status&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (Cirrus_Status&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (Cirrus_Status&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460((uint8_t)Status_Register, CirrusTemp);
  
  CirrusTemp[0]= (Cirrus_Mask&0xFF0000UL)>>16UL;
  CirrusTemp[1]= (Cirrus_Mask&0x00FF00UL)>>8UL;
  CirrusTemp[2]= (Cirrus_Mask&0x0000FFUL);
  
  WriteReg_SPIsw_CS5460((uint8_t)Mask_Register, CirrusTemp);              
  
 } 
        

/* *********** */
/* End of file */
/* *********** */


																	  







